README.org

#+OPTIONS: toc:2          
* El tercero

This is the project initializer used internally at Robopill,
nothing too amazing, the template files are embedded 
so it can be used in any computer without worry,
everyone is encouraged to fork it 
and modify the template files to their needs
AND it guides you when you run it, so, no real
need for a true readme, just run ~etr~!

If you have [[https://github.com/go-task/task][Task]] installed, just run ~task install~ otherwise run ~go build  -o bin/etr -ldflags="-s -w" src/etr.go~ then copy it to somewhere in your ~$PATH~
**** Quick note
+ You shouldn't run binaries from the internet, even if it's from an open source project, 
so I encourage you to
compile it yourself, anyways, if you still want to run the binaries compiled
by a stranger you can download:
[[https://github.com/hyakuburns/El_Tercero/releases][here]].
** Supported answers
| Question     | Valid Answers                                                    | Notes                                                          |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| Project name | ~you have to email me and ask me if your project name is ok~       |                                                                |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| Language     | ~c~, ~cpp~, ~go~, ~rs~, ~zig~                                              |                                                                |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| Build system | ~cmake~, ~meson~, ~premake~                                            | Go defaults to [[https://github.com/go-task/task][Task]]                                            |
|              |                                                                  | Zig defaults to ~build.zig~ files                                |
|              |                                                                  | Rust defaults to ~cargo~ since I think 99.9% of people use cargo |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| License      | For bsd: ~b~, ~bsd~                                                  |                                                                |
|              | Numbers: ~1~, ~2~, ~3~, ~4~                                              |                                                                |
|              | For gpl: ~g~, ~gpl~                                                  |                                                                |
|              | Numbers: ~2~, ~2 or later~, ~3, ~3 or later~                            |                                                                |
|              | For mit: ~mit~                                                     |                                                                |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| Author       | ~Again, you have to email me with your name and before you use it~ |                                                                |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|
| Git or HG?   | ~git~, ~hg~, ~both~                                                    |                                                                |
|--------------+------------------------------------------------------------------+----------------------------------------------------------------|

*** Aditional Notes
    + Sets up clang-format with google style
    + It sets up compile-commands exporting in CMake (meson has it by default and premake can't do that)
    + It sets up rustfmt with sane defaults
    + Sets up ZLS for zig
